Catalogs/Nomenclature.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Nomenclature</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.NomenclatureCategories</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Article</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionLong</Name>
					<Comment>Descriptive name</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EnableCustomsDeclarations</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EnableSerialNumbers</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.NomenclatureTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.NomenclatureAccessGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>UserDefinedProperties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalPropertiesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalPropertiesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/NomenclatureTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>NomenclatureTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Product</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Service</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Nomenclature/Forms/ItemForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Version control
	ModuleVersionControl.OnCreateAtServer(ThisForm);
	
	// Properties
	PropertySet = ModulePropertiesOverride.GetPropertySetByNomenclatureCategory(Object.Category);
	ModuleProperties.OnCreateAtServer(ThisForm, Object, "AdditionalPropertiesGroup", PropertySet);

	ModuleKeyAttributes.DisableAttributes(ThisForm);
	
EndProcedure


&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
//	Properties
	If ModulePropertiesClient.ProcessNotifications(ThisForm, EventName, Parameter) Then
		RefreshAdditionalPropertyControls();
	EndIf;

EndProcedure


&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	// Properties
	ModuleProperties.BeforeWriteAtServer(ThisForm, CurrentObject);

	ModuleKeyAttributes.AssignWritingSettings(ThisForm, CurrentObject);

EndProcedure


&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	ModuleKeyAttributes.DisableAttributes(ThisForm);
	
EndProcedure


&AtServer
Procedure RefreshNomenclatureCategory()

	If Object.Type <> Object.Category.Type Then
		Object.Type = Object.Category.Type;
	EndIf;

EndProcedure


///////////////////////////////////////////////////////////////////////////////
// FORM EVENT HANDLERS

&AtClient
Procedure CategoryOnChange(Item)
	
	RefreshAdditionalPropertyControls();

	RefreshNomenclatureCategory();

	EnableAttributes();

EndProcedure


&AtClient
Procedure DescriptionLongStartListChoice(Item, StandardProcessing)
	
	StandardProcessing = False;

	List = New ValueList;
	List.Add(Object.Description);

	Result = ChooseFromList(List, Items.DescriptionLong);
	If Result <> Undefined Then
		Object.DescriptionLong = Result.Value;
		Modified = True;
	EndIf;

EndProcedure


&AtClient
Procedure DescriptionOnChange(Item)
	
	If IsBlankString(Object.DescriptionLong) Then
		Object.DescriptionLong = Object.Description;
	EndIf;

EndProcedure

 
//&AtClient
Procedure EnableAttributes()

	IsProduct = Object.Type = PredefinedValue("Enum.NomenclatureTypes.Product");

	Items.EnableCustomsDeclarations.Enabled = IsProduct;
	Items.EnableSerialNumbers.Enabled = IsProduct;

EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROPERTY SYSTEM PROCEDURES


&AtClient
Procedure EditPropertyConfiguration(Command)
	
	ModulePropertiesClient.EditPropertyConfiguration(ThisForm);
	
EndProcedure


&AtServer
Procedure RefreshAdditionalPropertyControls()
	
	If ThisForm.__Properties_EnableProperties Then
		PropertySet = ModulePropertiesOverride.GetPropertySetByNomenclatureCategory(Object.Category);
		ModuleProperties.RefreshAdditionalPropertyControls(ThisForm, Object, PropertySet);
	EndIf;
	
EndProcedure



//////////////////////////////////////////////////////////////////////////
// FORM COMMAND HANDLERS

// Handler of the command created by Disable Key Attributes system.
//
&AtClient
Procedure EnableKeyAttributes(Command)

	If NOT Object.Ref.IsEmpty() Then
		Result = OpenFormModal("Catalog.Nomenclature.Form.KeyAttributes");
		If TypeOf(Result) = Type("Array") AND Result.Count() > 0 Then

			ModuleKeyAttributesClient.EnableFormControls(ThisForm, Result);

		EndIf;
	EndIf;

EndProcedure


&AtClient
Procedure OnOpen(Cancel)
	
	EnableAttributes();
	
EndProcedure
